CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/src/gd32a50x_can.c
    /* clear register bits, disable FD mode, then enable rx FIFO mode */
    CAN_CTL0(can_periph) &= ~(CAN_CTL0_FDEN | CAN_CTL0_DMAEN | CAN_CTL0_FS);
    CAN_CTL2(can_periph) &= ~CAN_CTL2_RFFN;
    CAN_CTL0(can_periph) |= CAN_CTL0_RFEN;

    /* clear FIFO status */
    CAN_STAT(can_periph) = (uint32_t)0xFFFFFFFFU;
    while(CAN_STAT(can_periph) & CAN_STAT_MS5_RFNE) {
        CAN_STAT(can_periph) = CAN_STAT_MS5_RFNE;
    }

    /* set DMA mode */
    if((uint8_t)ENABLE == can_fifo_para_init->dma_enable) {
        CAN_CTL0(can_periph) |= CAN_CTL0_DMAEN;
    }

    /* configure filter format */
    CAN_CTL0(can_periph) |= (can_fifo_para_init->filter_format_and_number & CAN_CTL0_FS);
    /* configure filter number */
    CAN_CTL2(can_periph) |= (can_fifo_para_init->filter_format_and_number & CAN_CTL2_RFFN);
    /* configure fifo public fiter */
    CAN_RFIFOPUBF(can_periph) = can_fifo_para_init->fifo_public_filter;
    /* configure fifo private fiter */
    if(!(CAN_CTL0(can_periph) & CAN_CTL0_RPFQEN)) {
        for(num = 0U; num < CAN_MAX_MAILBOX_NUM; num++) {
            CAN_RFIFOMPF(can_periph, num) = can_fifo_para_init->fifo_public_filter;
        }
    }
}

/*!
    \brief      configure rx FIFO filter table
    \param[in]  can_periph: CANx(x=0,1)
    \param[in]  id_filter_table: id filter table struct
                  remote_frame: CAN_DATA_FRAME_ACCEPTED, CAN_REMOTE_FRAME_ACCEPTED
                  extended_frame: CAN_STANDARD_FRAME_ACCEPTED, CAN_EXTENDED_FRAME_ACCEPTED
                  id: 11 bits for standard frame, 29 bits for extended frame
    \param[out] none
    \retval     none
*/
void can_rx_fifo_filter_table_config(uint32_t can_periph, can_rx_fifo_id_filter_struct id_filter_table[])
{
    /* set rx FIFO ID filter table elements */
    uint32_t i = 0U, j = 0U, num_of_filters = 0U;
    uint32_t val = 0U;
    uint32_t id_format = 0U;
    uint32_t *filter_table = (uint32_t *)(uint32_t)(CAN_RAM(can_periph) + 0x00000060U);

    num_of_filters = (GET_CTL2_RFFN(CAN_CTL2(can_periph)) + 1U) * 8U;
    id_format = CAN_CTL0(can_periph) & CAN_CTL0_FS;

    switch(id_format) {
    case(CAN_FIFO_FILTER_FORMAT_A):
        /* one full id (standard and extended) per id filter table element */
        for(i = 0U; i < num_of_filters; i++) {
            val = 0U;

            if(CAN_REMOTE_FRAME_ACCEPTED == id_filter_table[i].remote_frame) {
                val |= CAN_FDESX_RTR_A;
            }
            if(CAN_EXTENDED_FRAME_ACCEPTED == id_filter_table[i].extended_frame) {
                val |= CAN_FDESX_IDE_A;
                val |= (uint32_t)FIFO_FILTER_ID_EXD_A(id_filter_table[i].id);
            } else {
                val |= (uint32_t)FIFO_FILTER_ID_STD_A(id_filter_table[i].id);
            }
            filter_table[i] = val;
        }
        break;
    case(CAN_FIFO_FILTER_FORMAT_B):
        /* two full standard id or two partial 14-bit (standard and extended) id */
        j = 0U;
        for(i = 0U; i < num_of_filters; i++) {
            val = 0U;

            if(CAN_REMOTE_FRAME_ACCEPTED == id_filter_table[j].remote_frame) {
                val |= CAN_FDESX_RTR_B0;
            }
            if(CAN_EXTENDED_FRAME_ACCEPTED == id_filter_table[j].extended_frame) {
                val |= CAN_FDESX_IDE_B0;
                val |= (uint32_t)FIFO_FILTER_ID_EXD_B0(id_filter_table[j].id);
            } else {
                val |= (uint32_t)FIFO_FILTER_ID_STD_B0(id_filter_table[j].id);
            }
            j++;

            if(CAN_REMOTE_FRAME_ACCEPTED == id_filter_table[j].remote_frame) {
                val |= CAN_FDESX_RTR_B1;
            }
            if(CAN_EXTENDED_FRAME_ACCEPTED == id_filter_table[j].extended_frame) {
                val |= CAN_FDESX_IDE_B1;
                val |= (uint32_t)FIFO_FILTER_ID_EXD_B1(id_filter_table[j].id);
            } else {
                val |= (uint32_t)FIFO_FILTER_ID_STD_B1(id_filter_table[j].id);
            }
            j++;

            filter_table[i] = val;
        }
        break;
    case(CAN_FIFO_FILTER_FORMAT_C):
        /* four partial 8-bit standard id per id filter table element */
        j = 0U;
        for(i = 0U; i < num_of_filters; i++) {
            val = 0U;
            if(CAN_EXTENDED_FRAME_ACCEPTED == id_filter_table[j].extended_frame) {
                val |= (uint32_t)FIFO_FILTER_ID_EXD_C0(id_filter_table[j].id);
            } else {
                val |= (uint32_t)FIFO_FILTER_ID_STD_C0(id_filter_table[j].id);
            }
            j++;
            if(CAN_EXTENDED_FRAME_ACCEPTED == id_filter_table[j].extended_frame) {
                val |= (uint32_t)FIFO_FILTER_ID_EXD_C1(id_filter_table[j].id);
            } else {
                val |= (uint32_t)FIFO_FILTER_ID_STD_C1(id_filter_table[j].id);
            }
            j++;
            if(CAN_EXTENDED_FRAME_ACCEPTED == id_filter_table[j].extended_frame) {
                val |= (uint32_t)FIFO_FILTER_ID_EXD_C2(id_filter_table[j].id);
            } else {
                val |= (uint32_t)FIFO_FILTER_ID_STD_C2(id_filter_table[j].id);
            }
            j++;
            if(CAN_EXTENDED_FRAME_ACCEPTED == id_filter_table[j].extended_frame) {
                val |= (uint32_t)FIFO_FILTER_ID_EXD_C3(id_filter_table[j].id);
            } else {
                val |= (uint32_t)FIFO_FILTER_ID_STD_C3(id_filter_table[j].id);
            }
            j++;

            filter_table[i] = val;
        }
        break;
    case(CAN_FIFO_FILTER_FORMAT_D):
        /* all frames rejected */
        break;
    default:
        /* should not get here */
        break;
    }
}

/*!
    \brief      read rx FIFO data
    \param[in]  can_periph: CANx(x=0,1)
    \param[out] rx_fifo: rx FIFO struct
    \retval     none
*/
void can_rx_fifo_read(uint32_t can_periph, can_rx_fifo_struct *rx_fifo)
{
    uint32_t *rx_fifo_addr = (uint32_t *)rx_fifo;
    uint32_t *can_mb = (uint32_t *)CAN_RAM(can_periph);

    /* read FIFO descriptor 0 */
    rx_fifo_addr[0] = can_mb[0];
    rx_fifo_addr[1] = can_mb[1];
    rx_fifo->data[0] = can_mb[2];
    rx_fifo->data[1] = can_mb[3];

